Object.defineProperty(exports, "__esModule", { value: !0 }),
  (exports.default = void 0);
var e,
  a = require("../../@babel/runtime/helpers/defineProperty"),
  n =
    (a(
      a(
        a(
          a(
            a(
              a(
                a(
                  a(
                    a(
                      a(
                        (e = {
                          appName: ["优惠平台", "ئېتىبار"],
                          loadingTxt: ["请稍等", "سەل ساقلاڭ"],
                          opratingSuccess: ["成功了", "مۇۋاپىقيەتلىك بولدى"],
                          opratingError: [
                            "发生错误了，再试一下",
                            "خاتالىق كۆرۈلدى، قايتا سىناڭ",
                          ],
                          inputTranslateStr: [
                            "请输入要翻译的内容",
                            "تەرجىمە قىلماقچى بولغان مەزمۇننى كىرگۈزۈڭ",
                          ],
                          inputLan: ["你输入的文字", "كىرگۈزگىنىڭىز"],
                          uy: ["维吾尔文", "ئۇيغۇرچە"],
                          ch: ["中文", "دۆلەت تىلى"],
                          paste: ["粘贴", "چاپلاش"],
                          copy: ["复制", "كۆچۈرۈش"],
                          clear: ["清空", "تازلاش"],
                          reading: ["朗读", "ئوقۇتۇش"],
                          pinyin: ["拼音", "پىنيىن"],
                          translate: ["翻译", "تەرجىمە قىىلىش"],
                          forward: ["转发", "تارقىتىش"],
                          fromWhere: [
                            "物品从哪里出发",
                            "نەرسىنى ئالىدىغان ئورۇن",
                          ],
                          toWhere: [
                            "物品送到哪里",
                            "نەرسىنى ئاپىرىدىغان ئورۇن",
                          ],
                          selectGoodsDetail: [
                            "选择物品信息",
                            " بويۇمىنىڭ تەپسىلاتىنى تاللاڭ",
                          ],
                          selectArea: ["选择区域", "رايون تاللاش"],
                          locationArea: ["当前定位城市", "ھازىرقى ئورنىڭىز"],
                          wallet: ["钱包", "ھەميان"],
                          mySend: ["我的发布", "يوللىغانلىرىم"],
                          mySaved: ["我的收藏", "ساقلىغانلىرىم"],
                          resume: ["我的简历", "تەرجىمىھالىم"],
                          feedBack: ["反馈意见", "تەكلىپ-پىكىر"],
                          contact: ["联系电话", "ئالاقىلشىش"],
                          _contact: ["联系客服", "ئالاقلىشىڭ"],
                          notPassed: ["审核未过", "تەستىقلانمىدى"],
                          passed: ["审核已过", "تەستىقلاندى"],
                          review: ["审核中", "تەستىقلىنىۋاتىدۇ"],
                          _delete: ["删除", "ئۆچۈرۈش"],
                          edit: ["编辑", "ئۆزگەرتىش"],
                          iKnow: ["知道了", "بىلدىم"],
                          refresh: ["刷新", "يېڭىلاش"],
                          warning: ["温馨提醒", "ئەسكەرتىش"],
                          _warning: ["温馨提醒", "سەممى ئەسكەرتىش"],
                          realyDel: [
                            "确定要删除嘛？",
                            "راستىنلا يۇيىۋىتەمسىز؟",
                          ],
                          cancel: ["取消", "بىكار قىلىش"],
                          confirm: ["确认", "جەزىملەش"],
                          checked: ["确认审核", "تەستىقلاش"],
                          onChecked: ["已审核过", "تەستىقلاندى"],
                          unChecked: ["审核未过", "تەستىقلانمىدى"],
                          inChecked: ["正在审核", "تەستىقلىنىۋاتىدۇ"],
                          check: ["查询", "تەكشۈرۈش"],
                          alreadyHasContent: [
                            "已有内容",
                            "ئالاقىدار مەزمۇن بار",
                          ],
                          realyChecked: [
                            "真的确认审核吗？",
                            "تەستىقلاشنى جەزىملەشتۇرەمسىز؟",
                          ],
                          realyCancelChecked: [
                            "真的取消吗？",
                            "  بىكار قىلامسىز؟",
                          ],
                          save: ["保存", "ساقلاش"],
                          productImage: ["商品图片", "مەھسۇلات رەسمى"],
                          detail: ["详细介绍", "تەپسىلاتى"],
                          details: ["详情", "تەپسىلاتى"],
                          share: ["分享", "ھەمبەھىرلەش"],
                          phone: ["电话", "تېلفۇن"],
                        }),
                        "translate",
                        ["翻译", "تەرجىمان"]
                      ),
                      "chating",
                      ["聊天", "پاراڭلىشىش"]
                    ),
                    "noContent",
                    ["暂无内容", "مەزمۇن يۇق"]
                  ),
                  "expired",
                  ["已过期", "ۋاقىتى توشتى"]
                ),
                "chatWarn",
                [
                  "对方没回复的情况下只能发送3条信息",
                  "قارشى تەرەپ خەت قايتۇرمىغان ئەھۋال ئاستىدا،پەقەت 3 قېتىم ئۇچۇر يازالايسىز",
                ]
              ),
              "login",
              ["登录", "كىرىش"]
            ),
            "manager",
            ["管理员", "باشقۇرغۇچى"]
          ),
          "contact",
          ["联系电话", "ئالاقىلشىش"]
        ),
        "offLine",
        ["下架", "چۈشۈرۈش"]
      ),
      "noPosition",
      ["你是一个没立场的人", "سىزنىڭ پەقەتلا مەيدانىڭىز يوقكەن"]
    ),
    a(
      a(
        a(
          a(
            a(
              a(
                a(
                  a(
                    a(
                      a(e, "sendAnonymous", ["匿名发布", "نامسىز يوللاش"]),
                      "anonymousMessage",
                      ["匿名信息", "نامسىز ئۇچۇر"]
                    ),
                    "myAddress",
                    ["我的地址", "ئادىرىسىم"]
                  ),
                  "inputPhone",
                  ["请输入手机号", "تېلىفۇن نومۇرىڭىزنى كىرگۈزۈڭ"]
                ),
                "errPhone",
                ["电话号码错误", "تېلىفۇن نومۇرى خاتا"]
              ),
              "address",
              ["地址", "ئادىرىسى"]
            ),
            "clickSelectAddress",
            ["点击搜索地址", "بېسىپ كىرىپ ئىزدەڭ"]
          ),
          "houseNum",
          ["门牌号", "ئىشىك نومۇرى"]
        ),
        "inputHouseNum",
        ["单位/小区 / 门牌号", "قورۇ / بىنا / ئىشىك نومۇرى"]
      ),
      "contactPerson",
      ["联系人", "ئالاقىلاشقۇچى"]
    ),
    a(
      a(
        a(
          a(
            a(
              a(
                a(
                  a(
                    a(
                      a(e, "inputContactPerson", [
                        "联系人姓名",
                        "ئالاقىلاشقۇچى ئىسمى",
                      ]),
                      "sex",
                      ["性别", "جىنسى"]
                    ),
                    "man",
                    ["先生", "ئەر"]
                  ),
                  "fman",
                  ["女士", "ئايال"]
                ),
                "age",
                ["年龄", "يېشى"]
              ),
              "addAddress",
              ["新建地址", "يېڭى ئادرېس"]
            ),
            "deleteAddress",
            ["删除地址", "ئادرېسنى يۇيۇش"]
          ),
          "search",
          ["搜索", "ئىزدەش"]
        ),
        "inputAddress",
        ["请输入地址", "ئادرېسنى كىىرگۈزۈڭ"]
      ),
      "materialInfo",
      ["物品信息", "بۇيۇم ئۇچۇرى"]
    ),
    a(
      a(
        a(
          a(
            a(
              a(
                a(
                  a(
                    a(
                      a(e, "materialType", ["物品类型", "تۈرى"]),
                      "materialValue",
                      ["物品价值", "باھاسى"]
                    ),
                    "materialWeight",
                    ["物品重量", "ئېغىرلىقى"]
                  ),
                  "selectType",
                  ["选择类型", "تۈرنى تاللاڭ"]
                ),
                "selectValue",
                ["请选择价值", "باھاسىنى تاللاڭ"]
              ),
              "selectWeight",
              ["请选择重量", "ئېغىرلىقىنى تاللاڭ"]
            ),
            "confirmOrder",
            ["确认订单", "زاكاسنى مۇقۇملاشتۇرۇڭ"]
          ),
          "remark",
          ["备注", "ئەسكەرتىش"]
        ),
        "remarkWarn",
        ["物品描述或送件要求", "نەرسىنى تەسۋىرلەڭ ياكى تەلەپنى يېزىڭ"]
      ),
      "tip",
      ["小费", "تارتۇق"]
    ),
    a(
      a(
        a(
          a(
            a(
              a(
                a(
                  a(
                    a(
                      a(e, "tipWarn", [
                        "加小费抢单更快",
                        "تارتۇقلىسىڭىز زاكاس تىزراق بىر تەرەپ قىلنىدۇ",
                      ]),
                      "tipMaxWarn",
                      ["最高200元", "يۇقىرسى 200 يۈەن"]
                    ),
                    "pickupTime",
                    ["取件时间", "ئالدىغان ۋاقىت"]
                  ),
                  "submitOrder",
                  ["提交订单", "زاكاسنى تاپشۇرۇش"]
                ),
                "noAdd",
                ["不加了", "قاتمايمەن"]
              ),
              "otherValue",
              ["其他金额", "باشقا سومما"]
            ),
            "today",
            ["今天", "بۈگۈن"]
          ),
          "yesterday",
          ["昨天", "تۈنۈگۈن"]
        ),
        "getNow",
        ["立即取件", "ھازىرلا ئېلىش"]
      ),
      "clickToSpeak",
      ["点击说话", "بىسىپ تۇرۇپ سۆزلەڭ"]
    ),
    a(
      a(
        a(
          a(
            a(
              a(
                a(
                  a(
                    a(
                      a(e, "audioRemark", ["语音备注", "ئاۋازلىق ئەسكەرتىش"]),
                      "recordingWarn",
                      ["时间太短了，再试一次", "سۆزلەش ۋاقتى قىسقا،قايتا سىناڭ"]
                    ),
                    "recordWarn",
                    [
                      "时间不能少于3秒，不能超过60秒",
                      "ۋاقىت 3 سىېكۇتتتىن ئاز ياكى 60 سىېكۇتتتىن ئارتۇق بولمىسۇن",
                    ]
                  ),
                  "listenIt",
                  ["听一听", "ئاڭلاپ باقاي"]
                ),
                "totalPrice",
                ["总价", "ئومۇمىي سوممسى"]
              ),
              "priceDetails",
              ["费用明细", "باھا جەدۋىلى"]
            ),
            "pickup",
            ["帮我送", "ۋاكالىتەن يەتكۈزۈش"]
          ),
          "purchasing",
          ["帮我买", "ۋاكالىتەن سېتىۋېلىش"]
        ),
        "unpayed",
        ["未支付", "پۇل تۆلەنمىگەن"]
      ),
      "payed",
      ["已支付", "پۇل تۆلەنگەن"]
    ),
    a(
      a(
        a(
          a(
            a(
              a(
                a(
                  a(
                    a(a(e, "pay", ["付款", "پۇل تۆلەش"]), "orderDetail", [
                      "订单详情",
                      "زاكاس تەپسىلاتى",
                    ]),
                    "baseFee",
                    ["跑腿费", "يۈگۈر-يىتىم ھەققى"]
                  ),
                  "weightFee",
                  ["重量附加费", "ئېغىرلىق ھەققى"]
                ),
                "distanceFee",
                ["距离附加费", "ئارلىق ھەققى"]
              ),
              "orderNo",
              ["订单号", "زاكاس نومۇرى"]
            ),
            "selectLan",
            ["切换语言", "تىل ئالماشتۇرۇش"]
          ),
          "lanUy",
          ["ئ‍ۇيغۇرچە", "ئ‍ۇيغۇرچە"]
        ),
        "lanCh",
        ["中文", "中文"]
      ),
      "inputGoods",
      [
        "请输入您想要的产品细情",
        "ئالماقچى بولغان مەھسۇلاتىڭىزنىڭ  تەپسىلاتىنى كىرگۈزۈڭ",
      ]
    ),
    a(
      a(
        a(
          a(
            a(
              a(
                a(
                  a(
                    a(a(e, "takeOrder", ["下单", "بۇيرۇش"]), "referenceInfo", [
                      "供骑手购买时参考",
                      "يەتكۈزگچى سىتۋالغاندا پايدىلنىدۇ",
                    ]),
                    "estimateGoodFee",
                    ["预估商品费", "مۆلچەر باھا"]
                  ),
                  "buy",
                  ["购买", "سېتىۋېلىىش"]
                ),
                "designatedAddress",
                ["指定地址", "بەلگىلەنگەن ئادىرىسى"]
              ),
              "nearbyAddress",
              ["骑手就近购买", "ئىختىيارىي سېتىۋېلىش"]
            ),
            "buyWhere",
            ["在哪里购买", "قەيەردىن ئالىمەن"]
          ),
          "deliveryToWhere",
          ["送到哪里去", "قەيەرگە ئاپىرىمەن"]
        ),
        "receipt",
        ["收货", "تاپشۇرۋېلىش"]
      ),
      "receiptAddress",
      ["收货地址", "تاپشۇرۋېلىىش ئادېرسى"]
    ),
    a(
      a(
        a(
          a(
            a(
              a(
                a(
                  a(
                    a(
                      a(e, "estimateMaxWarn", ["最高500元", "يۇقىرسى 500يۈەن"]),
                      "name",
                      ["姓名", "ئىسمى"]
                    ),
                    "idCard",
                    ["身份证号", "كىملىك نومۇرى"]
                  ),
                  "wechat",
                  ["微信", "ئۈندىدار"]
                ),
                "selectWechat",
                ["请选择微信", "ئۈندىدارىنى تاللاڭ"]
              ),
              "inputWechat",
              ["请输入微信", "ئۈندىدار نومۇرىڭىزنى كىرگۈزۈڭ"]
            ),
            "inputName",
            ["请输入姓名", "ئىسىمنى كىرگۈزۈڭ"]
          ),
          "inputIdCard",
          ["请输入身份证号", "كىملىك نومۇرنى كىرگۈزۈڭ"]
        ),
        "allOrder",
        ["全部订单", "بارلىق زاكاس"]
      ),
      "todaysOrder",
      ["今天的订单", "بۈگۈنكى زاكاس"]
    ),
    a(
      a(
        a(
          a(
            a(
              a(
                a(
                  a(
                    a(
                      a(e, "yesterdayOrder", ["昨天的订单", "تۈنۈگۈنكى زاكاس"]),
                      "deliveryMan",
                      ["骑手", "يەتكۈزگۈچى"]
                    ),
                    "grabOrders",
                    ["抢单", "زاكاس تالىشىش"]
                  ),
                  "grabOrdersSuccess",
                  ["抢单成功", "زاكاس تالىشىش مۇۋاپقيەتلىك بولدى"]
                ),
                "grabOrdersFail",
                ["抢单失败", "زاكاس تالىشىش مەغلۇپ بولدى"]
              ),
              "dispatch",
              ["派单", "تەقسىملەش"]
            ),
            "select",
            ["选择", "تاللاش"]
          ),
          "isDispatched",
          ["该订单已经被派单好了", "بۇ زاكاس  تەقسىملىنىپ بولۇنغان"]
        ),
        "dispatchSucc",
        ["派单成功", "تەقسىملەش مۇۋاپقيەتلىك بولدى"]
      ),
      "realyCancelOrder",
      ["真要取消订单吗？", "زاكاسنى راستىنلا بىكار قىلامسىز؟"]
    ),
    a(
      a(
        a(
          a(
            a(
              a(
                a(
                  a(
                    a(
                      a(e, "cancelOrderSucc", [
                        "取消订单成功",
                        "زاكاسنى بىكار قىلىش مۇۋاپقيەتلىك بولدى",
                      ]),
                      "takeOrderSuccess",
                      ["下单成功", "زاكاس چۈشۈرۈش مۇۋاپقيەتلىك بولدى"]
                    ),
                    "notLocation",
                    [
                      "定位失败或者该区域没有相关的服务",
                      "ئورۇن بەلگىلەش مەغلۇپ بولدى ياكى بۇ رايوندا مۇلازىمەت يوق",
                    ]
                  ),
                  "location",
                  ["定位", "ئورۇن بەلگىلەش"]
                ),
                "locationFail",
                ["定位失败", "ئورۇن بەلگىلەش مەغلۇپ بولدى"]
              ),
              "notService",
              [
                "休息或者不在服务时间之内",
                "ئارام ئالغان ياكى مۇلازىمەت ۋاقتى ئەمەس",
              ]
            ),
            "cantService",
            [
              "该区域内还没提供相关的服务",
              " رايون ھازىرچە مۇلازىمەت بىلەن تەمىنلەنمەيدۇ",
            ]
          ),
          "canceld",
          ["已取消", "بىكار قىلىندى"]
        ),
        "inDelivery",
        ["配送中", "يەتكۈزۈلۋاتىدۇ"]
      ),
      "completed",
      ["已完成", "تاماملاندى"]
    ),
    a(
      a(
        a(
          a(
            a(
              a(
                a(
                  a(
                    a(
                      a(e, "complete", ["完成", "تاماملاش"]),
                      "authorzationSuccess",
                      ["授权成功", "ھوقۇق بېرىش مۇۋاپقيەتلىك بولدى"]
                    ),
                    "authorzationFail",
                    [
                      "授权失败，再试一下",
                      "ھوقۇق بېرىش مەغلۇپ بولدى،قايتا سىىناڭ",
                    ]
                  ),
                  "audioOrderWarn",
                  [
                    "为了语音下单请点击留言您想要订购物品的详情及配送地址信息",
                    "قانداق ياردەم كىرەك بولسا ئاۋازلىق قالدورۇپ قويۇڭ",
                  ]
                ),
                "notAudio",
                ["语音没录好", "ئاۋاز ئۈنگە ئېلىنمىغان"]
              ),
              "selectTypes",
              ["选择类型", "تۈرنى تاللاڭ"]
            ),
            "selectDistance",
            ["选择距离", "ئارلىقنى تاللاڭ"]
          ),
          "chName",
          ["中文名称", "دۆلەت تىلى ئاتىلشى"]
        ),
        "uyName",
        ["维文名称", "ئۇيغۇرچە ئاتىلىشى"]
      ),
      "inputUyName",
      ["请输入维语名称", "ئۇيغۇرچە ئاتىلىشنى كىرگۈزۈڭ"]
    ),
    a(
      a(
        a(
          a(
            a(
              a(
                a(
                  a(
                    a(
                      a(e, "inputChName", [
                        "请输入中文名称",
                        "دۆلەت تىلى ئاتىلىشنى كىرگۈزۈڭ",
                      ]),
                      "translate",
                      ["翻译", "تەرجىمان"]
                    ),
                    "audioOrder",
                    ["语音订单", "ئاۋازلىق زاكاس"]
                  ),
                  "confirmReceipt",
                  ["确认收货", "تاپشورۇپ ئالدىم"]
                ),
                "orderState",
                ["订单状态", "زاكاس ھالىتى"]
              ),
              "waitingForOrder",
              ["等待接单", "قوبۇللىنۋاتىدۇ"]
            ),
            "cancelOrder",
            ["取消订单", "بىكار قىلىش"]
          ),
          "canceldSuccess",
          [
            "申请取消订单成功，请等待",
            "بىكار قىلىش مۇۋاپقيەتلىك بولدى، سەل ساقلاڭ",
          ]
        ),
        "canceldOrderError",
        [
          "取消订单失败，可能订单已被接单",
          "بىكار قىلىش مەغلۇپ بولدى،زاكاس بىر تەرەپ قىلىنىپ بولۇنغان",
        ]
      ),
      "project",
      ["项目", "تۈرلەر"]
    ),
    a(
      a(
        a(
          a(
            a(
              a(
                a(
                  a(
                    a(
                      a(e, "dispatchOrderNum", [
                        "抢单数量",
                        "زاكاس تالشىش سانى",
                      ]),
                      "canOpen",
                      ["是否营业", "تىجارەت قىلىۋاتامدۇ"]
                    ),
                    "canDispatch",
                    ["是否抢单", "زاكاس تالىشالامدۇ"]
                  ),
                  "inputPass",
                  ["请输入密码", "مەخپىي نومۇرنى كىرگۈزۈڭ"]
                ),
                "passError",
                ["密码错误", "مەخپىي نومۇر خاتا"]
              ),
              "todaySum",
              ["今天的收入", "بۈگۈنكى كىرىم"]
            ),
            "yestSum",
            ["昨天的收入", "تۈنۈگىنكى كىرىم"]
          ),
          "balance",
          ["余额", "قالدۇق"]
        ),
        "changePass",
        ["更改密码", "مەخپىي نومۇر ئۆزگەرتىش"]
      ),
      "oldPass",
      ["原来的密码", "ئەسلىدىكى مەخپى نومۇر"]
    ),
    a(
      a(
        a(
          a(
            a(
              a(
                a(
                  a(
                    a(
                      a(e, "newPass", ["新的密码", "يېڭى مەخپىي نومۇر"]),
                      "newPassAgain",
                      ["重新输入", "يەنە بىر قېتىم كىرگۈزۈڭ"]
                    ),
                    "passNotEqual",
                    ["新密码不一致", "يېڭى مەخپىي نومۇر بىردەك ئەمەس"]
                  ),
                  "oldPassError",
                  ["原来的密码错误", "ئەسلىدىكى مەخپىي نومۇر خاتا"]
                ),
                "confirmDelivery",
                ["确认送货", "يەتكۈزۈپ بولدۇم"]
              ),
              "applicationCancelOrder",
              ["申请取消的订单", "بىكار قىلىش ئىلتىماس قىلىنغان زاكاس"]
            ),
            "freeOptional",
            ["自选", "ئىختىيارى تاللاش"]
          ),
          "freeOptionalDesc",
          ["可选可不选", "تاللىسڭىزمۇ ياكى تاللىمسىڭىزمۇ بولىدۇ"]
        ),
        "allSum",
        ["总数", "ھەممىسى"]
      ),
      "startTime",
      ["开业时间", "ئېچىلىش ۋاقىتى"]
    ),
    a(
      a(
        a(
          a(
            a(
              a(
                a(
                  a(
                    a(
                      a(e, "endTime", ["关闭时间", "تاقىلىش ۋاقىتى"]),
                      "addShop",
                      ["添加店铺", "دۇككان قوشۇش"]
                    ),
                    "shopImage",
                    ["店铺图片", "دۇككان رەسمى"]
                  ),
                  "shopName",
                  ["店铺名称", "دۇككان ئىسمى"]
                ),
                "inputShopName",
                ["请输入店铺名称", "دۇككان ئىسمىنى كىرگۈزۈڭ"]
              ),
              "inputShopAddress",
              ["请输入店铺地址", "دۇككان ئادرېسىنى كىرگۈزۈڭ"]
            ),
            "shopType",
            ["店铺类型", "دۇككان تۈرى"]
          ),
          "startPrice",
          ["起送", " تۆۋەن چەك"]
        ),
        "_startPrice",
        ["起送", "باشلىندۇ"]
      ),
      "startBuy",
      ["起购", "باشلىندۇ"]
    ),
    a(
      a(
        a(
          a(
            a(
              a(
                a(
                  a(
                    a(a(e, "fen", ["份", ""]), "deliveryFee", [
                      "配送费",
                      "يەتكۈزۈش ھەققى",
                    ]),
                    "yuan",
                    ["元", "يۈەن"]
                  ),
                  "minut",
                  ["分钟", "مىنۇت"]
                ),
                "onLine",
                ["上架", "چىقىرىىش"]
              ),
              "offLine",
              ["下架", "چۈشۈرۈش"]
            ),
            "broadCast",
            ["通知", "ئۇقتۇرۇش"]
          ),
          "shopPercent",
          ["收益比例", "پايدا نىسبىتى"]
        ),
        "shopState",
        ["营业状态", "دۇككان ھالىتى"]
      ),
      "isOpening",
      ["正在营业", "تىجارەت قىلىۋاتىدۇ"]
    ),
    a(
      a(
        a(
          a(
            a(
              a(
                a(
                  a(
                    a(a(e, "isClosing", ["关闭", "تاقاقلىق"]), "addType", [
                      "添加分类",
                      "تۈر قوشۇش",
                    ]),
                    "addProduct",
                    ["添加产品", "مەھسۇلات قوشۇش"]
                  ),
                  "newType",
                  ["新的分类", "يېڭى تۈر"]
                ),
                "productImage",
                ["产品图片", "مەھسۇلات رەسمى"]
              ),
              "productName",
              ["产品名称", "مەھسۇلات ئىسمى"]
            ),
            "inputProductName",
            ["请输入产品名称", "مەھسۇلات ئىسمىنى كىرگۈزۈڭ"]
          ),
          "price",
          ["价格", "باھاسى"]
        ),
        "inputPrice",
        ["请输入价格", "باھاسىنى كىرگۈزۈڭ"]
      ),
      "nearbyShops",
      ["附近商家", "ئەتراپتىكى دۇكانلار"]
    ),
    a(
      a(
        a(
          a(
            a(
              a(
                a(
                  a(
                    a(a(e, "also", ["还", "يەنە"]), "lack", ["差", "كەم"]),
                    "toOrder",
                    ["立即订购", "دەرھال بۇيرۇش"]
                  ),
                  "all",
                  ["全部", "ھەممىسى"]
                ),
                "shopSum",
                ["小计", "پۇلى"]
              ),
              "pay",
              ["付款", "پۇل تۆلەش"]
            ),
            "leaveMessage",
            ["留言", "خەت قالدورۇش"]
          ),
          "inputLeaveMessage",
          ["给商家留言", "ئەسكەرتىش مەزمۇننى كىرگۈزۈڭ"]
        ),
        "allAmount",
        ["金额", "سوممىسى"]
      ),
      "_allAmount",
      ["总计", "ئۇمۇمىي سوممىسى"]
    ),
    a(
      a(
        a(
          a(
            a(
              a(
                a(
                  a(
                    a(a(e, "amount", ["总计", "سوممىسى"]), "payWay", [
                      "付费方式",
                      "پۇل تۆلەش شەكلى",
                    ]),
                    "weixin",
                    ["微信", "ئۈندىدار"]
                  ),
                  "selectAddress",
                  ["请选择地址", "ئادېرىسى تاللاڭ"]
                ),
                "shopPhone",
                ["店铺电话", "دۇككان نومۇرى"]
              ),
              "myShop",
              ["我的店铺", "دۇكىنىم"]
            ),
            "locationFail",
            ["定位失败", "ئورۇن بەلگىلەش مەغلۇپ بولدى"]
          ),
          "select",
          ["选择", "تاللاڭ"]
        ),
        "selectMaterialWarn",
        [
          "请选择物品的类型，价格，重量等选项",
          "بۇيۇمنىڭ تۈرى،باھاس،ئېغىرلىقى قاتارلىق تۈرلەرنى بىسىپ كىرىپ تاللاڭ",
        ]
      ),
      "addAddressWarn",
      [
        "带红点的选项必须要选择或填写，没红点的自选",
        "قىزىل چىكىت قويۇلغانلىرنى چۇقۇم تاللايسىز ياكى تولدۇرۇسىز،قىزىل چىكىت قويۇلمىغانلىرنى تالىسىڭىزمۇ بولدۇ تاللىمىسىڭىزمۇ بولدۇ",
      ]
    ),
    a(
      a(
        a(
          a(
            a(
              a(
                a(
                  a(
                    a(
                      a(e, "shopStar", ["星星等级", "يولتۇز دەرجىسىى"]),
                      "orderNumError",
                      ["订单号不正确", "زاكاس نومۇرى توغرا ئەمەس"]
                    ),
                    "shop",
                    ["店铺", "دۇككان"]
                  ),
                  "withDraw",
                  ["提现", "نەخلەش"]
                ),
                "wage",
                ["工资", "مائاشى"]
              ),
              "withDrawWarn",
              [
                "每天只能一次提现，一次最多能提现余额的百分之五",
                "بىر كۈندە پەقەت بىر قىتىم نەخلىيەلەيسىز،بىر قىتىمدا ئەڭ كۆپ بولغاندا قالدۇقنىڭ بەش پىرسەنتنى نەخلىيەلەيسىز",
              ]
            ),
            "maxWithdrawValue",
            [
              "你要提现的余额超过额度",
              "نەخلەش سومىڭىز يوقىرى چەكتىن ئىشپ كەتكەن",
            ]
          ),
          "shopFinanceWarn",
          [
            "一次能提现50到500元之间",
            "بىر قىتىمدا50~500يۈەن ئارلىقدا نەخلىيەلەيسىز",
          ]
        ),
        "message",
        ["短信", "ئۇچۇر"]
      ),
      "shopShow",
      ["店铺显示", "دۇككان كۆرۈنشى"]
    ),
    a(
      a(
        a(
          a(
            a(
              a(
                a(
                  a(
                    a(
                      a(e, "financeWarn", [
                        "今天的收入明天结账",
                        "بۈگۈنكى ھىساۋات ئەتە بوغۇلدۇ",
                      ]),
                      "recommend",
                      ["推荐", "تەۋسىيە"]
                    ),
                    "getPhoneNumber",
                    ["获取手机号", "تېلفۇن ئارقىلىق كىرىش"]
                  ),
                  "loginWarn",
                  [
                    "获取微信绑定的手机号，你授权才可以获取",
                    "ئۈندىدارغا باغلاغلىق تېلفۇن نومۇرىغا ھوقۇق بەرسىڭىز ئاندىن مەشخۇلات قىلغىلى بولدۇ",
                  ]
                ),
                "unsettled",
                ["未结账", "ھىساۋات قىلىنمىغان"]
              ),
              "settled",
              ["已结账", "ھىساۋات قىلىنغان"]
            ),
            "pickupNumber",
            ["取件号", "نومۇرى"]
          ),
          "Promotions",
          ["优惠活动", "ئېتىبارلىق پائالىيەت"]
        ),
        "addActivity",
        ["添加活动", "پائالىيەت قوشۇش"]
      ),
      "activityContent",
      ["活动内容", "پائالىيەت مەزمۇنى"]
    ),
    a(
      a(
        a(
          a(
            a(
              a(
                a(
                  a(
                    a(
                      a(e, "inputActivityContent", [
                        "请输入活动内容",
                        "پائالىيەت مەزمۇنىنى كىرگۈزۈڭ",
                      ]),
                      "activityImage",
                      ["活动图片", "پائالىيەت رەسمى"]
                    ),
                    "activityStartTime",
                    ["活动开始时间", "باشلىنىش ۋاقىتى"]
                  ),
                  "activityEndTime",
                  ["活动结束时间", " ئاخىرلىشىش ۋاقىتى"]
                ),
                "selectShop",
                ["选择店铺", "دۇككان تاللاش"]
              ),
              "startTimeCantEqualEndTime",
              [
                "开始时间跟结束时间不能相同",
                "باشلىنىش ۋاقىتى بىلەن ئاخىرلىشىش ۋاقىتى ئوخشاش بولسا بولمايدۇ",
              ]
            ),
            "activityEnded",
            ["活动已结束", "پائالىيەت ئاخىرلاشتى"]
          ),
          "willStartActivity",
          ["活动开始", "پائالىيەت باشلىندۇ"]
        ),
        "activity",
        ["活动", "پائالىيەت"]
      ),
      "activityPrice",
      ["活动价格", "پائالىيەت باھاسى"]
    ),
    a(
      a(
        a(
          a(
            a(
              a(
                a(
                  a(
                    a(
                      a(e, "takeAway", ["外卖", "تاماق بۇيرۇش"]),
                      "isRecording",
                      ["录音中", "ئۈنگە ئېلىۋاتىدۇ"]
                    ),
                    "selectFoodsType",
                    ["请选择食物类型", "تاماقنىڭ تۈرنى تاللاڭ"]
                  ),
                  "new",
                  ["新的", "يېڭى"]
                ),
                "_payed",
                ["已结账", "ھېسابات قىلىنغان"]
              ),
              "_unpayed",
              ["未结账", "ھېسابات قىلىنمىغان"]
            ),
            "order",
            ["订单", "زاكاس"]
          ),
          "driving",
          ["代驾", "ۋاكالىتەن ماشىنا ھەيدەش"]
        ),
        "agent",
        ["代办", "ۋاكالىتەن ئىش بىجىرىش"]
      ),
      "housekeeping",
      ["家政", "ئائىلە مۇلازىمتى"]
    ),
    a(
      a(
        a(
          a(
            a(
              a(
                a(
                  a(
                    a(
                      a(e, "recordAgain", ["重新录音", "قايتا ئۈنگە ئالاي"]),
                      "listenRecord",
                      ["听一下录音", " ئاڭلاپ باقايچۇ"]
                    ),
                    "howTakeOrder",
                    ["如何下订单", "قانداق زاكاس چۈشۈرمەن؟"]
                  ),
                  "inputRemark",
                  ["请输入备注", "ئەسكەرتمەكچى بولغان مەزمۇننى كىرگۈزۈڭ"]
                ),
                "selectServiceType",
                ["请选择服务类型", "مۇلازىمەت تۈرنى تاللاڭ"]
              ),
              "serviceFee",
              ["服务费用", "مۇلازىمەت ھەققى"]
            ),
            "showHomePage",
            ["首页显示", "باش بەت كۆرۈنشى"]
          ),
          "clickIntoSpeak",
          ["点进去下语音订单", "بىسىپ كىرىپ سۆزلەڭ"]
        ),
        "home",
        ["首页", "باش بەت"]
      ),
      "shopRestinng",
      ["本店休息中", "مەزكۇر دۇككان دەم ئېلىۋاتىدۇ"]
    ),
    a(
      a(
        a(
          a(
            a(
              a(
                a(
                  a(
                    a(
                      a(e, "retryAgain", ["再试一次", "قايتا سىناپ باقاي"]),
                      "uploadIdCard",
                      ["请上传身份证正面", "كىملىكنىڭ ئالدى تەرپىنى يوللاڭ"]
                    ),
                    "relatedImage",
                    ["相关的图片", "ئالاقىدار رەسىم"]
                  ),
                  "ownerCanOperation",
                  ["是否可以操作", "مەشخۇلات قىلالامدۇ"]
                ),
                "topSort",
                ["置顶", "چوقۇلاش"]
              ),
              "inputPickupNumber",
              ["请输入取件号", "مال ئېلىش نۇمۇرنى كىرگۈزۈڭ"]
            ),
            "chargeServiceType",
            ["充值服务", "مۇلازىمەت تۈرى"]
          ),
          "inputWeizhangNumber",
          [
            "请输入15-16位罚款决定书编号",
            "خانىلىق جەرىمانە نومۇرنى كىرگۈزۈڭ 15-16",
          ]
        ),
        "weizhangNumberError",
        [
          "您输入的罚款决定书编号有错，请输入15位或16位罚款决定书编号",
          "سىز كىرگۈزگەن جەرىمانە نومۇرى خاتا،15ياكى 16 خانىلىق جەرىمانە نومۇرنى توغرا كىرگۈزۈڭ ",
        ]
      ),
      "enterWeizhangInfo",
      ["填写代缴信息", "جەرىمانە ئوچۇرنى كىرگۈزۈڭ"]
    ),
    a(
      a(
        a(
          a(
            a(
              a(
                a(
                  a(
                    a(
                      a(e, "selectWeizhangTime", [
                        "罚单日期",
                        "جەرىمانە ۋاقىتى",
                      ]),
                      "weizhangTimeError",
                      ["请选择罚款日期", "جەرىمانە قويۇلغان ۋاقىتنى تاللاڭ"]
                    ),
                    "fakuanAmount",
                    ["罚款金额", "جەرىمانە سوممىسى"]
                  ),
                  "inputFakuanAmount",
                  ["请输入罚款金额", "جەرىمانە سوممىسنى كىرگۈزۈڭ"]
                ),
                "zhinajin",
                ["滞纳金", "جەرىمانە ئۆسۈمى"]
              ),
              "uploadFakuan",
              ["请上传罚款单子", "جەرىمانە قەغىزنى رەسىمگە تارتىپ يوللاڭ"]
            ),
            "payNow",
            ["马上缴费", "پۇل تۆلەش"]
          ),
          "weizhangCertificate",
          ["罚单代缴用户协议", "جەرىمانە تۆلەش كىلىشىمنامسى"]
        ),
        "weizhang",
        ["违章代缴", "جەرىمانە تۆلەش"]
      ),
      "agree",
      ["同意", "قۇشۇلىمەن"]
    ),
    a(
      a(
        a(
          a(
            a(
              a(
                a(
                  a(
                    a(
                      a(e, "noAgree", ["不同意", "قۇشۇلمايمەن"]),
                      "weizhangCertification1",
                      [
                        "罚单信息和日期必须正确输入",
                        "جەرىمانە ئوچۇرنى ھەم ۋاقتىنى چۇقۇم توغرا كىرگۈزۈڭ",
                      ]
                    ),
                    "weizhangCertification2",
                    [
                      "避免重复缴费，确认退款之前不要重复缴费",
                      "قايتىلاپ تۆلىنىپ كىتىشتىن ساقلىنىش ئۈچۈن،باشقا ئورۇندا قايتىلاپ تاپشۇرماڭ",
                    ]
                  ),
                  "weizhangWarn",
                  [
                    "只限于新疆交通工具违章罚款",
                    "پەقەت شىنجاڭ ئىچىدىكى قاتناش جەرىمانسى بىلەن چەكلىندۇ",
                  ]
                ),
                "uknown",
                ["未知", "نامەلۇم"]
              ),
              "dianfeiCertification",
              ["缴电费协议", "توك پۇلى تۆلەش كىلىشىمنامسى"]
            ),
            "dianfeiCertification1",
            [
              "请准确输入电卡账户",
              "ئابونتلار نومۇرنى توغرا كىرگۈزۈشكە كاپالەتلىك قىلىڭ",
            ]
          ),
          "dianfeiWarn",
          [
            "电卡网上支付业务要开放",
            "توك كارتىسنىڭ توردا پۇل تۆلەش كەسپى ئوچۇق بولۇشى كىرەك",
          ]
        ),
        "inputCardNum",
        ["请输入用户号", "ئابونىتلار نومۇرنى كىرگۈزۈڭ"]
      ),
      "errorCardNum",
      ["请输入正确的用户号", "توغرا بولغان ئابونىتلار نومۇرنى كىرگۈزۈڭ"]
    ),
    a(
      a(
        a(
          a(
            a(
              a(
                a(
                  a(
                    a(
                      a(e, "rechargeAmount", ["充值金额", "قاچىلاش سوممىسى"]),
                      "inputRechargeAmount",
                      ["请输入充值金额", "قاچىلاش سوممىسىنى كىرگۈزۈڭ"]
                    ),
                    "uploadCard",
                    [
                      "请上传电卡正面",
                      "توك كارتىسنىڭ ئالدىنى رەسىمگە تارتىپ يوللاڭ",
                    ]
                  ),
                  "dealing",
                  ["正在处理", "بىر تەرەپ قىلىنۋاتدۇ"]
                ),
                "chargePhoneSuccess",
                ["话费充值成功", "پۇل قاچىلاش مۇۋاپىقيەتلىك بولدى"]
              ),
              "chargePhone",
              ["充话费", "تېلېفۇن پۇلى قاچىلاش"]
            ),
            "contactWith",
            [
              "有任何问题跟客服联系",
              "ھەرقانداق مەسلە بولسا بىز بىلەن ئالاقلىشىڭ",
            ]
          ),
          "rechargeFlow",
          ["流量充值", "ئېقىم قاچىلاش"]
        ),
        "flowPackage",
        ["流量包", "ئېقىم بوغچىسى"]
      ),
      "dianfei",
      ["缴电费", "توك پۇلى تۆلەش"]
    ),
    a(
      a(
        a(
          a(
            a(
              a(
                a(
                  a(
                    a(
                      a(e, "chargeFlowSuccess", [
                        "流量充值成功",
                        "ئېقىم قاچىلاش مۇۋاپىقيەتلىك بولدى",
                      ]),
                      "realyCompoleted",
                      ["确定已完成吗？", "راستىنلا تاماملاپ بولدىڭىزمۇ"]
                    ),
                    "hotLine",
                    ["热线", "قىزىق لىنىيە"]
                  ),
                  "finance",
                  ["财务", "مالىيە"]
                ),
                "weizhangDetail",
                [
                  "机动车，摩托车，电动车等交通工具违章代缴",
                  "ماشىنا، موتسىكلىت، توكسىكلىت  قاتارلىق قاتناش ۋاستلىرنىڭ جەرىمانسىنى تۆلگىلى بولىدۇ",
                ]
              ),
              "volunteerService",
              ["志愿者服务", "پىدائىيلار مۇلازىمىتى"]
            ),
            "chargeHomeWarn",
            [
              "如充值失败，你的付款全部24小时内退回来",
              "ئەگەر پۇل قاچىلاش مەغلۇپ بولسا،تۆلىگەن پۇلىڭىزنىڭ ھەممىسى 24 سائ‍ەت ئىچىدە قايتىپ كىلىدۇ",
            ]
          ),
          "iRecommend",
          ["我也推广挣钱", "مەنمۇ تەۋسىيە قىلىپ پۇل تاپاي"]
        ),
        "userFinanceWarn",
        ["余额超过1元才可以提现", "قالدۇق 1 يۈەندىن ئاشقاندا نەخلىگىلى بولىدۇ"]
      ),
      "inputAmount",
      ["请输入金额", "سوممىسنى كىرگۈزۈڭ"]
    ),
    a(
      a(
        a(
          a(
            a(
              a(
                a(
                  a(
                    a(a(e, "mine", ["我的", "مىنىڭ"]), "linkGongzhongHao", [
                      "连接公众号",
                      "سالونغا ئۇلاش",
                    ]),
                    "salonName",
                    ["公众号名称", "سالون ئىسمى"]
                  ),
                  "inputSalonName",
                  ["请输入公众号名称", "سالون ئىسمىنى كىرگۈزۈڭ"]
                ),
                "submit",
                ["提交", "يوللاش"]
              ),
              "contactWithYou",
              ["工作人员跟您联系", "خىزمەتچى خادىم سىز بىلەن ئالاقلىشىدۇ"]
            ),
            "frindHelpPay",
            ["朋友帮我付", "دوستۇم قاچىلاپ بەرسۇن"]
          ),
          "helpCHargeMe",
          ["朋友帮我充话费吧", "ماڭا ياردەم قىلسىڭىز"]
        ),
        "inputCartUserName",
        ["请输入持卡人姓名", "كارتا ئىگىسنىڭ ئىسمىنى كىرگۈزۈڭ"]
      ),
      "phoneHistory",
      ["充值记录", " پۇل قاچىلاش خاتىرىسى"]
    ),
    a(
      a(
        a(
          a(
            a(
              a(
                a(
                  a(
                    a(
                      a(e, "accessNotification", [
                        "接受订单通知",
                        "زاكاس ئۇقتۇرشىنى قوبۇللاش",
                      ]),
                      "charging",
                      ["正在充值中", "قاچىلنىۋاتىدۇ"]
                    ),
                    "arrears",
                    ["欠费", "قەرىز سوممىسى"]
                  ),
                  "orderCount",
                  ["订单数", "زاكاس سانى"]
                ),
                "startDate",
                ["开始时间", "باشلىىنىش ۋاقىتى"]
              ),
              "endDate",
              ["结束时间", "ئاخىرلىشىش ۋاقىتى"]
            ),
            "cash",
            ["到货付款", " نەخ پۇل تۆلەش"]
          ),
          "orderNum",
          ["订单数量", "زاكاس سانى"]
        ),
        "avgPrice",
        ["平均价格", "ئوتتۇرچە باھاسى"]
      ),
      "scanner",
      ["扫描", "سىكانىىرلاش"]
    ),
    a(
      a(
        a(
          a(
            a(
              a(
                a(
                  a(
                    a(
                      a(e, "inHouse", ["入库", "ئامبارغا كىرگۈزۈش"]),
                      "outHouse",
                      ["出库", "ئامباردىن چىقىرىش"]
                    ),
                    "onHouse",
                    ["在库房", "ئامباردا"]
                  ),
                  "contentExist",
                  ["内容已经存在", "مەزمۇن ئالىبورۇن ساقلانغان"]
                ),
                "signature",
                ["签名", "ئىمزا قويۇش"]
              ),
              "repeatWrite",
              ["重写", "قايتا يېزىش"]
            ),
            "queryExpress",
            ["快递查询", "پوسۇلكا تەكشۈرۈش"]
          ),
          "expressComp",
          ["快递公司", "تىز يوللانما شىركىتى"]
        ),
        "expressNo",
        ["快递单号", "يوللانما نومۇرى"]
      ),
      "query",
      ["查询", "تەكشۈرۈش"]
    ),
    a(
      a(
        a(
          a(
            a(
              a(
                a(
                  a(
                    a(
                      a(e, "queryFail", [
                        "查询失败，请输入正确的快递单号",
                        "تەكشۈرۈش مەغلۇپ بولدى،،توغرا بولغان پوسۇلكا نومۇرىنى كىرگۈزۈڭ",
                      ]),
                      "querySuccess",
                      ["查询订单成功", "تەكشۈرۈش مۇۋاپىقيەتلىك بولدى"]
                    ),
                    "translateToUy",
                    ["翻译成维吾尔语", "ئۇيغۇرچىغا تەرجىمە قىلىش"]
                  ),
                  "inputCurrectExpressNo",
                  [
                    "请输入准确的快递单号",
                    "توغرا بولغان پوسۇلكا نومۇرىنى كىرگۈزۈڭ",
                  ]
                ),
                "inputExpressNo",
                [
                  "请输入你要查询的快递单号",
                  "تەكشۈرمەكچى بولغان پوسۇلكا نومۇرنى كىرگۈزۈڭ",
                ]
              ),
              "income",
              ["收入", "كىرىم"]
            ),
            "expenses",
            ["支出", "چىقىىم"]
          ),
          "addFinance",
          ["添加财务", "ھىسابات قوشۇش"]
        ),
        "fresh",
        ["生鲜", "يېشىل يىمەكلىك"]
      ),
      "sendMsg",
      ["发信息", "ئوچۇر يوللاش"]
    ),
    a(
      a(
        a(
          a(
            a(
              a(
                a(
                  a(
                    a(
                      a(e, "addConstract", ["添加合同", "توختام قوشۇش"]),
                      "agentFees",
                      ["代理费", "ۋاكالەتچىلىك ھەققى"]
                    ),
                    "agentASign",
                    ["A方签名", "ئا تەرەپ ئىمىزا"]
                  ),
                  "agentBSign",
                  ["B方签名", "بى تەرەپ ئىمىزا"]
                ),
                "inputYourMessage",
                ["请详细输入您的信息", "ئۇچۇرىڭىزنى تەپسىلى كىرگۈزۈڭ"]
              ),
              "uploadYourImage",
              ["请上传您个人照", "ئۈزىڭىزنىڭ رەسمىنى يوللاڭ"]
            ),
            "paySuccessed",
            ["支付成功", "پۇل تۆلەش مۇۋاپىقيەتلىك بولدى"]
          ),
          "selfIntrduction",
          ["简单的自我介绍", "ئۆزۈڭىزنى قىسقىچە تونۇشتورۇڭ"]
        ),
        "myService",
        ["我的服务", "مۇلازىمەتلىرىم"]
      ),
      "otherService",
      ["其他服务", "باشقا مۇلازىمەتلەر"]
    ),
    a(
      a(
        a(
          a(
            a(
              a(
                a(
                  a(
                    a(a(e, "table", ["桌子", "ئۈستەل"]), "cashBack", [
                      "返现",
                      "قايتىدۇ",
                    ]),
                    "money",
                    ["钱", "پۇل"]
                  ),
                  "takeMeal",
                  ["订餐", "تاماق زاكاس قىلىش"]
                ),
                "takeTable",
                ["扫码点餐", "سىكانىرلاپ تاماق بۇيرۇش"]
              ),
              "shoppingCart",
              ["购物车", "ھارۋام"]
            ),
            "staffPosition",
            ["职位", "خىزمەت ئورنى"]
          ),
          "acceptOrder",
          ["接单", "قۇبۇللاش"]
        ),
        "realyConfirm",
        ["确认完成订单吗?", "زاكاسنى راستىنلا تاماملامسىز"]
      ),
      "takeFoodNum",
      ["取餐号码", "تاماق ئېلىش نۇمۇرى"]
    ),
    a(
      a(
        a(
          a(
            a(
              a(
                a(
                  a(
                    a(
                      a(e, "eatInShop", ["餐厅就餐", "ئاشخانىدا يەيمەن"]),
                      "takeFood",
                      ["打包带走", "ئېلىپ كىتىمەن"]
                    ),
                    "inDevelopment",
                    ["正在开发中", "بۇ ئىقتىدار ياسىلىۋاتىدۇ"]
                  ),
                  "myWallet",
                  ["钱包", "پۇل قاپچۇقۇم"]
                ),
                "addImage",
                ["添加图片", "رەسىم قوشۇش"]
              ),
              "scanShopType",
              ["扫描打开方式", "سىكانىرلاپ ئېچلىش شەكلى"]
            ),
            "forgetIt",
            ["算了", "بولدىلا"]
          ),
          "orderingService",
          ["点餐服务", "تاماق بۇيرۇش مۇلازىمىتى"]
        ),
        "selectTableNum",
        ["请选择桌号", "ئۈستەل نۇمۇرنى تاللاڭ"]
      ),
      "goodReview",
      ["好评", "ياخشىكەن"]
    ),
    a(
      a(
        a(
          a(
            a(
              a(
                a(
                  a(
                    a(a(e, "badReview", ["差评", "ناچاركەن"]), "myCoupon", [
                      "优惠券",
                      " كارتىلىرىم",
                    ]),
                    "unused",
                    ["未使用", "ئىشلەتمىگىنىم"]
                  ),
                  "expiration",
                  ["已过期", "ۋاقىتى ئۆتكەنلىرى"]
                ),
                "couponCart",
                ["抵扣券", "ئېتىبار كارتىسى"]
              ),
              "validPeriod",
              ["有效期", "ئىناۋەتلىك ۋاقىتى"]
            ),
            "numberOfPeople",
            ["人数", "ئادەم سانى"]
          ),
          "payForShop",
          ["付给商家", "دۇكاندارغا پۇل تۆلەش"]
        ),
        "couponAmount",
        ["抵扣金额", "ئېتىبار سوممىسى"]
      ),
      "actulyPayed",
      ["实际支付", "ئەمەلى تۆلىندىغان سوممىسى"]
    ),
    a(
      a(
        a(
          a(
            a(
              a(
                a(
                  a(
                    a(
                      a(e, "confirmPay", ["确认付款", "پۇل تۆلەش"]),
                      "orderAmount",
                      ["订单金额", "زاكاس سوممىسى"]
                    ),
                    "payedTime",
                    ["支付时间", "تۆلەنگەن ۋاقتى"]
                  ),
                  "scanPay",
                  ["扫码支付", "سىكانىرلاپ پۇل تۆلەش"]
                ),
                "expanderPercent",
                ["拓展员提成", "بازار ئاچقۇچى"]
              ),
              "addShareholder",
              ["添加股东", "پايچىك قوشۇش"]
            ),
            "scanTableGenerateCoupon",
            ["扫码点餐产生优惠券", "سىكانىرلاپ تاماق بۇيرۇپ ئېتىبارغا ئېرىشىش"]
          ),
          "addAgency",
          ["添加代理", "ۋاكالەتچى قوشۇش"]
        ),
        "shopIncome",
        ["店铺收入", "دۇككان كىرىمى"]
      ),
      "advertIncome",
      ["广告收益", "تەشۋىقات كىرىمى"]
    ),
    a(
      a(
        a(
          a(
            a(
              a(
                a(
                  a(
                    a(
                      a(e, "deliveryService", [
                        "配送服务",
                        "يەتكۈزۈزش مۇلازىمىتى",
                      ]),
                      "broudcastM",
                      ["播报器", "ئەسكەرتىش لاباسى"]
                    ),
                    "bind",
                    ["绑定", "باغلاش"]
                  ),
                  "otherShopBind",
                  ["已经绑定到其他店铺", "باشقا دۇككانغا باغلاغلىق"]
                ),
                "addScanQRCode",
                ["绑定扫码点餐二维码", "ئۈستەل كۇدىنى باغلاش"]
              ),
              "scanOpenDefaultLan",
              ["默认语言", "سىكانىرلاپ ئېچىلغانكى تېل"]
            ),
            "distance",
            ["距离", "ئارلىق"]
          ),
          "onlyUseThisShop",
          ["只能在该店里使用", "مەزكۇر دۇككاندىلا ئىشلەيدۇ"]
        ),
        "useIt",
        ["去使用", "ئىشلىتەي"]
      ),
      "printUy",
      ["پىرىنتلاش", "پىرىنتلاش"]
    ),
    a(
      a(
        a(
          a(
            a(
              a(
                a(
                  a(
                    a(
                      a(e, "audioWarn", ["语音提醒", "ئاۋازلىق ئەسكەرتىش"]),
                      "alipay",
                      ["支付宝", "جىفۇباۋ"]
                    ),
                    "scannerPercent",
                    ["扫描付款收益比例", "سىكانىرلاپ پۇل تۆلەش نىسبىتى"]
                  ),
                  "bookingPercent",
                  ["预订收益比例", "ئالدىن بۇيرۇش نىسبىتى"]
                ),
                "takewayPercent",
                ["外卖收益比例", "ۋەيمەي نىسبىتى"]
              ),
              "bindPrinter",
              ["绑定小票机", "پىرىنتىرنى باغلاش"]
            ),
            "waiterOrder",
            ["服务员下单", "مۇلازىمەتچى زاكاس قىلىش"]
          ),
          "costumerTakeOrder",
          ["客户预订", "خىردار ئالدىن زاكاس قىلىش"]
        ),
        "inShop",
        ["进店", "كىرىش"]
      ),
      "tableCount",
      ["餐桌总数", "تاماق ئۈستىلى سانى"]
    ),
    a(
      a(
        a(
          a(
            a(
              a(
                a(
                  a(
                    a(
                      a(e, "checkedAccount", ["结账", "ھىسابات بۇغۇش"]),
                      "_cash",
                      ["现金", "نەخ پۇل"]
                    ),
                    "couponPercent",
                    ["优惠", "ئېتىبار"]
                  ),
                  "maxPrice",
                  ["最高价", "ئەڭ يۇقىرى باھا"]
                ),
                "minPrice",
                ["最低价", "ئەڭ تۆۋەن باھا"]
              ),
              "noCouponCart",
              ["暂无可用的优惠券", "ئىشلەتكىدەك ئېتىبارلىق بىلەت يوق"]
            ),
            "monthBuyed",
            ["月销", " سېتىلىشى"]
          ),
          "shopDetails",
          ["商家", "دۇكان تەپسىلاتى"]
        ),
        "shopIds",
        ["商家安全档案", "دۇككان رەسمىيەتلىرى"]
      ),
      "shopCondition",
      ["商家环境", "دۇككان مۇھىت رەسىملىرى"]
    ),
    a(
      a(
        a(
          a(
            a(
              a(
                a(
                  a(
                    a(
                      a(e, "shoppingTime", ["营业时间", "تىجارەت ۋاقتى"]),
                      "deliveryType",
                      ["配送方式", "يەتكۈزۈش شەكلى"]
                    ),
                    "etewarDelivery",
                    ["优惠江配送", "ئېتىبار يەتكۈزىدۇ"]
                  ),
                  "todaysCoupon",
                  ["今日优惠", "بۈگۈنكى ئېتىبارلار"]
                ),
                "couponFood",
                ["优惠餐", "ئېتىبارلىق تاماقلار"]
              ),
              "suanla",
              ["酸辣", "ئاچچىق چۈچۈك"]
            ),
            "zhang",
            ["张", "تال"]
          ),
          "visitCount",
          ["浏览次数", "زىيارەت قېتىم سانى"]
        ),
        "howGetMoney",
        ["如何挣钱?", "قانداق پۇل تاپىمەن؟"]
      ),
      "aboutGetMoney",
      [
        "您把您的专用二维码分享到朋友圈或者微信好友或者微信群里，如果某个人从您的二维码进入小程序并且下了外卖订单，您可以获取一定的推广费，推广费额度看订单金额大小",
        "سىز ئۆزىڭىزنىڭ خاسلىق چىپار كۇدىنى چەمبىرەك ياكى ئۈندىدار دۇسلىرىڭىزغا ۋە ياكى ئۈندىدار توپلىرىغا ھەمبەھىرلەيسىز،باشقلار سىز ھەمبەھىرلىگەن چىپار كۇد ئارقىلىق سىستىمغا كىرىپ تاماق بۇيرۇسا سىز مەلۇم سوممىدا تەشۋىقات ھەققىگە ئىرشەلەيسىز،تەشۋىقات سوممىسنىڭ ئاز كۆپلىكى ئومۇمىي سومىنىڭ ئاز كۆپلىكى بىلەن مۇناسىۋەتلىك ",
      ]
    ),
    a(
      a(
        a(
          a(
            a(
              a(
                a(
                  a(
                    a(
                      a(e, "uploadImage", ["图片上传", "رەسىم يوللاش"]),
                      "showShopCertificate",
                      ["商家资质信息公示", "سالاھىيەت ئۇچۇرنى ئېلان قىلىش"]
                    ),
                    "startingCount",
                    ["起送量", "باشلىنىش سانى"]
                  ),
                  "inputStartingCount",
                  ["请输入起送数量", "باشلىنىش سانىنى كىرگۈزۈڭ"]
                ),
                "packingFee",
                ["打包费", "ئوراش ھەققى"]
              ),
              "_packingFee",
              ["打包费", "قاچا ھەققى"]
            ),
            "specification",
            ["规格", "ئۆلچىمى"]
          ),
          "selectSpecification",
          ["选规格", "قوشۇش"]
        ),
        "addCart",
        ["加入购物车", "قوشۇش"]
      ),
      "selected",
      ["已选", "تاللانغىنى"]
    ),
    a(
      a(
        a(
          a(
            a(
              a(
                a(
                  a(
                    a(
                      a(e, "cleanCart", ["清空购物车", "تازلاش"]),
                      "maxCoupon",
                      ["最高抵扣", "ئەڭ يوقىرى ئېتىبار"]
                    ),
                    "cashCart",
                    ["现金券", "نەخ پۇل كارتىسى"]
                  ),
                  "hotLine",
                  ["服务热线", "مۇلازىمەت نومۇرى"]
                ),
                "buyLimit",
                ["购买限制", "سېتۋىلىش چەكلىمىسى"]
              ),
              "couponAllCount",
              ["优惠总数", "ئېتىبار سانى"]
            ),
            "breakfast",
            ["营养早餐", "قۇۋەت ناشتلىقلار"]
          ),
          "polo",
          ["抓饭烤肉", "پولۇ-كاۋاپ"]
        ),
        "readAndAgree",
        ["阅读并同意", "ئوقۇپ قوشۇلىمەن"]
      ),
      "agreement",
      ["用户协议", "  كىلىشىمنامە"]
    ),
    a(
      a(
        a(
          a(
            a(
              a(
                a(
                  a(
                    a(
                      a(e, "dontAgree", [
                        "你未同意相关的协议",
                        "سىز ئالاقىدار كىلشىمنامغا قوشۇلماپسىز",
                      ]),
                      "tryLucy",
                      ["试试运气", "تەلەي سىناش"]
                    ),
                    "pickupAtStore",
                    ["到店自提", "بېرىپ ئېلۋىلىش"]
                  ),
                  "getselfTime",
                  ["自取时间", "ئېلىش ۋاقتى"]
                ),
                "reservePhone",
                ["预留手机", "قالدۇرغان تېلېفۇن"]
              ),
              "discounted",
              ["已优惠", "ئېتىبار قىلىندى"]
            ),
            "customerPhone",
            ["客户电话", "خېرىدار تېلېفونى"]
          ),
          "canPickUp",
          ["支持自提", "ئۆزى ئېلىپ كىتىش"]
        ),
        "todays",
        ["今日", "بۈگۈنكى"]
      ),
      "coupons",
      ["优惠", "ئېتىبارلار"]
    ),
    a(
      a(
        a(
          a(
            a(
              a(
                a(
                  a(
                    a(a(e, "recommends", ["推荐", "تەۋسىيەلىك"]), "resturant", [
                      "餐厅",
                      "تاماقخانا",
                    ]),
                    "applyForAgent",
                    ["申请代理商", "ۋاكالەتچىلىكنى ئېلتىماس قىلىش"]
                  ),
                  "inputAgentAreaName",
                  ["请输入代理城市区域", "ۋاكالەتچى بولىدىغان رايۇننى كىرگۈزۈڭ"]
                ),
                "shippingAddress",
                ["收货地址", "ئورنىڭىز"]
              ),
              "receiver",
              ["收货人", "ئىسمىڭىز"]
            ),
            "uPhone",
            ["手机号", "تېلېفۇنىڭىز"]
          ),
          "more",
          ["更多", "تېخىمۇ كۆپ"]
        ),
        "shopsSortType",
        [
          { id: 0, uy_name: "تەۋسىيە", ch_name: "推荐" },
          { id: 1, uy_name: "يېقىن", ch_name: "距离" },
          { id: 2, uy_name: "ئاۋات", ch_name: "销量" },
        ]
      ),
      "inputSearchShop",
      ["请输入餐厅或美食名称搜索", "ئاشخانا ياكى تاماقنى كىرگۈزۈپ ئىزدەڭ"]
    ),
    a(
      a(
        a(
          a(
            a(
              a(
                a(
                  a(
                    a(
                      a(e, "isNotDelivery", [
                        "不在配送范围内",
                        "يەتكۈزۈش دائىرسىدە ئەمەس",
                      ]),
                      "scanCash",
                      [
                        "扫码点餐值支持现金",
                        "سىكانىرلاپ تاماق بۇيرۇشتا نەخ پۇللا قوللاش",
                      ]
                    ),
                    "isResting",
                    ["休息中", "ئارام ئېىلىۋاتىدۇ"]
                  ),
                  "shopLocation",
                  ["商铺位置", "دۇكان ئورنى"]
                ),
                "limitedBuy",
                ["限购一份", "ئېتىبارلىق بىرنىلا سېتۋالالايسىز"]
              ),
              "signIn",
              ["签到", "كىلىش يوقلىمسى"]
            ),
            "signOut",
            ["签退", "قايتىش يوقلىمىسى"]
          ),
          "soldOut",
          ["已售完", "سېتىلىپ بولدى"]
        ),
        "evaluation",
        ["评价", "باھالاش"]
      ),
      "deliverySatisfy",
      ["您对骑手满意吗？", "سىز چەۋەندازدىن رازىمۇ؟"]
    ),
    a(
      a(
        a(
          a(
            a(
              a(
                a(
                  a(
                    a(
                      a(e, "aboutArrived", [
                        "左右送达",
                        "ئەتىراپىدا يەتكۈزۈلدى",
                      ]),
                      "satisfy",
                      ["满意", "رازى"]
                    ),
                    "dissatisfied",
                    ["不满意", "رازى ئەمەس"]
                  ),
                  "inputDeliveryEvaluation",
                  ["请输入对骑手的评价", "چەۋەندازغا باھا بېرىپ بېقىڭ"]
                ),
                "shopAndGoodSatisfy",
                ["您对商家/商品满意吗？", "سىز دۇكان ياكى مەھسۇلاتىن رازىمۇ؟"]
              ),
              "overAll",
              ["总体", "ئومۇمى جەھەتتىن"]
            ),
            "quality",
            ["质量", " سۈپەت جەھەتتىن"]
          ),
          "package",
          ["包装", "ئورالما جەھەتتىن"]
        ),
        "inputForShop",
        [
          "对质量，包装不满意？可描述具体问题",
          "سۈپەت ياكى ئورالمىغا رازى بولمىسىڭىز پىكىرىڭىزنى كونكرېتنى يىزىپ قالدورۇڭ",
        ]
      ),
      "cha",
      ["差", "ناچار"]
    ),
    a(
      a(
        a(
          a(
            a(
              a(
                a(
                  a(
                    a(a(e, "zhong", ["中", "ئوتتۇرھال"]), "hao", [
                      "好",
                      "ياخشى",
                    ]),
                    "warehouse",
                    ["库房", "ئامبار"]
                  ),
                  "addWarehouse",
                  ["添加库存", "ئامبار قوشۇش"]
                ),
                "quantity",
                ["数量", "سانى"]
              ),
              "loading",
              ["正在加载", "يۈكلىنىۋاتىدۇ"]
            ),
            "noMore",
            ["没内容了", "مەزمۇن تۈگىدى"]
          ),
          "hotSearch",
          ["热门搜索", "كۆپ ئىزدەلگەنلىرى"]
        ),
        "historySearch",
        ["历史搜索", "ئىزدىگەنلىرىم"]
      ),
      "inCoupon",
      ["优惠价只购", "ئېتىبارلىق باھادا"]
    ),
    a(
      a(
        a(
          a(
            a(
              a(
                a(
                  a(
                    a(
                      a(e, "canBuy", ["份", "سېتۋالالايسىز"]),
                      "shopEvaluation",
                      ["评价", "ئىنكاسلار"]
                    ),
                    "etewarSupermarket",
                    ["优惠超市", "ئېتىبار تاللا بازىرى"]
                  ),
                  "sanGongliMianyun",
                  ["三公里免运费", "ئۈچ كىلومېتىر ئىچىدە كىراسىز"]
                ),
                "etewarService",
                ["优惠外卖为你服务", "ئېتىبار سىز ئۈچۈن مۇلازىمەت قىلىدۇ"]
              ),
              "_shopEvaluation",
              ["商家评分", "دۇكان باھاسى"]
            ),
            "_package",
            ["包装", "قاچىلنشى"]
          ),
          "taste",
          ["口味", "تەمى"]
        ),
        "deliveryEvaluation",
        ["配送评分", "يەتكۈزۈش باھا"]
      ),
      "_uknown",
      ["匿名", "نامەلۇم"]
    ),
    a(
      a(
        a(
          a(
            a(
              a(
                a(
                  a(
                    a(
                      a(e, "activityPriceNotGreaterOldPrice", [
                        "优惠价不能大于原价",
                        "ئېتىبار باھا ئەسلى باھادىن يۇقىرى بولسا بولمايدۇ",
                      ]),
                      "addCoupon",
                      ["添加优惠", "ئېتىبار قوشۇش"]
                    ),
                    "couponLimit",
                    ["到达金额", "ئېتىبار ئۆلچىمى"]
                  ),
                  "advertMoney",
                  ["看广告挣钱", "ئېلان كۆرۈپ پۇل تېپىش"]
                ),
                "advertMoneyDetail",
                [
                  "你看完一条视频广告，可以获取的一定的红包",
                  "ئېلانى تولۇق كۆرۈپ بولغاندىن كىيىن مەلۇم سوممىدا قىزىل بولاققا ئىرىشەلەيسىز",
                ]
              ),
              "bindBankCart",
              ["绑定银行卡", "بانكا كارتىسىنى باغلاش"]
            ),
            "inputPickupAddress",
            ["填写取件地址", "ئالىدىغان  ئادرېسنى تولدۇرۇڭ"]
          ),
          "inputReceivingAddress",
          ["填写收件地址", "تاپشۇرۇۋېلىش ئادرېسنى تولدۇرۇڭ"]
        ),
        "errandService",
        ["跑腿服务", "يۈگۈر-يېتىم"]
      ),
      "goTakeOrder",
      ["去下单", "زاكاس چۈشۈرۈش"]
    ),
    a(
      a(
        a(
          a(
            a(
              a(
                a(
                  a(
                    a(
                      a(e, "errandOrderStep", [
                        "帮送服务流程",
                        "زاكاس چۈشۈرۈش تەرتىپى",
                      ]),
                      "inputAnything",
                      ["填写任意商品 骑手帮你买", "نىمە لازىم بولسا  تولدۇرۇڭ"]
                    ),
                    "buAddress",
                    ["购买地址", "سېتىۋېلىش ئادرېسى"]
                  ),
                  "deliveryUseWhenBuy",
                  ["骑手购买的时候参考", "چەۋەندازلار  سېتىۋالغاندا پايدىلنىدۇ"]
                ),
                "inputNickName",
                ["请输入昵称", "ئىسىمنى كىرگۈزۈڭ"]
              ),
              "nickName",
              ["昵称", "ئىسمى"]
            ),
            "oneBtnConnectWifi",
            ["一键连WiFi", " بىر كۇنۇپكا ئارقىلىق WIFI ئۇلاش"]
          ),
          "systemNotSupportWifi",
          [
            "你的系统不支持一键链接WiFi",
            "سىستىمىڭىز بىر كۇنۇپكا ئارقىلىق ئۇلاشنى قوللىمايدۇ",
          ]
        ),
        "wifiName",
        ["wifi名称", "wifi ئىسمى"]
      ),
      "inputWifiName",
      ["请输入wifi名称", "Wifiئىسمىنى كىرگۈزۈڭ"]
    ),
    a(
      a(
        a(
          a(
            a(
              a(
                a(
                  a(
                    a(
                      a(e, "brandName", ["品牌名称", "ماركا ئاتالغوسى"]),
                      "inputBrandName",
                      ["请输入品牌名称", "ماركا ئاتالغوسىنى كىرگۈزۈڭ"]
                    ),
                    "wifiPass",
                    ["wifi密码", "wifi شىفىرى"]
                  ),
                  "inputWifiPass",
                  ["请输入wifi密码", "wifi مەخپىي نومۇرنى كىرگۈزۈڭ"]
                ),
                "inputAllContent",
                ["请填写完整信息", "مەزمۇنى تولۇق كىرگۈزۈڭ"]
              ),
              "addWifi",
              ["创建WiFi", "WiFi قوشۇش"]
            ),
            "linksCount",
            ["有效链接次数", "مۇۋاپىقيەتلىك ئ‍ۇلاش قىتىم سانى"]
          ),
          "manage",
          ["管理", "باشقۇرۇش"]
        ),
        "connectWifiSuccess",
        ["链接WiFi成功", "  ئۇلاش مۇۋاپىقيەتلىك بولدى"]
      ),
      "salonReceiveInfo",
      ["公众号收到信息", "سالۇن ئوچۇر قوبۇللاش"]
    ),
    a(
      a(
        a(
          a(
            a(
              a(
                a(
                  a(
                    a(
                      a(e, "officicalWarnInfo", [
                        "你还没关注Etewar外卖公众号或获取你的信息失败，如果你没关注公众号可以去关注公众号，如果你已经关注该公众号，进去公众号页面发1就可以",
                        "سىز Etewar外卖سالۇنىغا ئەگەشمەپسىز ياكى ئوچۇرىڭىزنى ئېلىش مەغلۇپ بوپتۇ.سىز مەزكۇر سالۇنغا ئەگىشۋالسىڭىز ياكى سالۇنغا 1نى يوللاپ قويسىڭىز بولدۇ",
                      ]),
                      "notBindBankCard",
                      [
                        "你还未绑定本人的银行卡，请先绑定银行卡，银行卡必须是店主本人的",
                        "سىز تېخى بانكا كارتىڭىزنى باغلىماپسىز ،ئالدى بىلەن ئۈزىڭىزنىڭ  بانكا كارتىسىنى  توغىرا باغلاڭ",
                      ]
                    ),
                    "withdrawFail",
                    ["提现失败", "نەخلەش مەغلۇپ بولدى"]
                  ),
                  "addPrinter",
                  ["添加打印机", "پىرىنتىر قوشۇش"]
                ),
                "printerTaype",
                ["打印机类型", "پىرىنتىر  تۈرى"]
              ),
              "test",
              ["测试", "سىناق"]
            ),
            "setting",
            ["设置", "تەڭشەك"]
          ),
          "voice",
          ["声音", "ئاۋاز"]
        ),
        "printerVoiceSetting",
        [
          { id: 4, uy_name: "يوق", ch_name: "无" },
          { id: 3, uy_name: "تىت-تىت ئاۋاز", ch_name: "滴滴声" },
          { id: 2, uy_name: "ئادەم ئاۋازى (كىچىك)", ch_name: "真人声音（小）" },
          {
            id: 1,
            uy_name: "ئادەم ئاۋازى (ئوتتۇرھال)",
            ch_name: "真人声音（中）",
          },
          {
            id: 0,
            uy_name: "ئادەم ئاۋازى (يۇقىرى)",
            ch_name: "真人声音（大）",
          },
        ]
      ),
      "canUseDuringBuisness",
      ["营业时间可用", "تىجارەت ۋاقتىدا ئىشلىتەلەيسىز"]
    ),
    a(
      a(
        a(
          a(
            a(
              a(
                a(
                  a(
                    a(
                      a(e, "supportPickup", ["可自提", "ئۈزىڭىز ئىلىۋالسىز"]),
                      "buyerKnow",
                      ["购买须知", "ئەسكەرتىش"]
                    ),
                    "groupCanUsedLimit",
                    [
                      "购买后30天有效",
                      "سېتىۋالغاندىن كىيىن 30 كۈن ئىچىدە ئىناۋەتلىك",
                    ]
                  ),
                  "usedTime",
                  ["使用时间", "ئىشلىتىش ۋاقىتى"]
                ),
                "groupUsedTimeLimit",
                ["营业时间内可用", "نورۇمال تىجارەت ۋاقتىدا ئىشلەتكىلى بولىدۇ"]
              ),
              "service",
              ["客服", "مۇلازىمەت"]
            ),
            "fen",
            ["份", "كىشلىك"]
          ),
          "hongbao",
          ["红包", "قىزىل بولاق"]
        ),
        "waitUsed",
        ["待使用", "ئىشلىتىلمىدى"]
      ),
      "takeOrderTime",
      ["下单时间", "زاكاس  ۋاقىت"]
    ),
    a(
      a(
        a(
          a(
            a(
              a(
                a(
                  a(
                    a(
                      a(e, "actualyPayed", ["实付", "ئەمەلىي سومما"]),
                      "setMealDetail",
                      ["到店吃套餐", "تاۋسەن تەپسىلارتى"]
                    ),
                    "completedTime",
                    ["消费时间", "تاماملانغان ۋاقىت"]
                  ),
                  "checkCode",
                  ["到店验券", "تەستىق كودى"]
                ),
                "goldPrice",
                ["黄金价格", "ئالتۇن باھاسى"]
              ),
              "oilPrice",
              ["油价", "ماي باھاسى"]
            ),
            "updateDate",
            ["更新时间", "يېڭىلانغان ۋاقىتى"]
          ),
          "couponPrice",
          ["特价", "ئالاھىدە باھا"]
        ),
        "unloginWarn",
        ["你还未登录，先确认登录", "سىز تېخى كىرمەپسىز،ئاۋال كىرىڭ"]
      ),
      "writeRemark",
      ["请填写备注", "ئىزاھات يېزىڭ"]
    ),
    a(
      a(
        a(
          a(
            a(
              a(
                a(
                  a(
                    a(
                      a(e, "remarkWarn", [
                        "不要辣或要太咸等",
                        "ئاچچىق بولمىسۇن ياكى  قىزىق كەلسۇن دىگەندەك",
                      ]),
                      "inputFoodRemark",
                      [
                        "请输入对口味，偏好等要求",
                        "تاماققا بولغان تەلپىڭىزنى يىزىڭ،ئاچچىق بولسۇن ياكى بىرنەرسە سالمىسۇن دىگەندەك",
                      ]
                    ),
                    "recommendToYou",
                    ["给您推荐", "سىزگە ئالاھىدە تەۋسىيە"]
                  ),
                  "getCoupon",
                  ["领取", "ئېلىش"]
                ),
                "scratchArea",
                ["刮刮区域", "قىرىش رايۇنى"]
              ),
              "isReceived",
              ["已领取", "ئېلىنىپ بولدى"]
            ),
            "workState",
            ["工作状态", "خىزمەت ھالىتى"]
          ),
          "rejectOrder",
          ["拒单", "رەت قىلىش"]
        ),
        "realyRejectOrder",
        ["确定要拒绝接单吗？", "زاكاسنى راستىنلا رەت قىلامسىز؟"]
      ),
      "open24H",
      ["24个小时开业", "24سائەت ئوچۇق"]
    ),
    a(a(e, "notification", ["通知", "ئوقتورۇش"]), "inputNotification", [
      "请输入通知内容",
      "ئوقتۇرۇش مەزمۇننى كىرگۈزۈڭ",
    ]));
exports.default = n;
